
; 本文是 WimTool - V2.0.2026.0103版文本资源，必须是Unicode(UTF-16LE)编码格式；
; 支持以";"或"//"为行首整行注释和行后注释，不支持段落注释；
; "[ ]"内的内容为 INI 配置文件的节名，其中的字符不要修改，各个节的顺序不能改变。

; 01、配置文件定义的文件目录路径，前导符(第1个字符)一定要是'\'或'*'；
; 02、以'\'为前导符表示的是相对于根的绝对路径，根的解释看第10、11点；
; 03、以'*'为前导符表示的是相对路径，相对于根的任何目录，可能匹配多次；
; 04、'?'匹配任何1个字符，但与'\'和'.'不匹配，也与字符串不匹配；
; 05、'*'匹配字符串，但与'\'和'.'不匹配，即匹配任何无扩展名的文件目录；
; 06、"*.*"匹配有任意扩展名的任意文件目录(但与无扩展名的不匹配)；
; 07、多级目录可带通配符'*'和'?'，如"\Win????\SYSTEM*\*.EXE"；
; 08、如果是确定的文件目录，尽量不要使用通配符，如"\PageFile.SYS"；
; 09、文件目录名忽略大小写，即不区分大小写，如"C:\"同"c:\"；
; 10、根与DOS定义类似，如捕获"D:\Tool"目录，则根为"D:\Tool"；
; 11、如向"D:\MyTools"解开一个WIM映像，则根为"D:\MyTools"。

[ExclusionList]			//设置被排除的文件目录，这些文件目录不会被捕获或解压。
				//此节的文件目录可自行增减
\$NTFS.LOG
\$Recycle.Bin
\$Windows.~bt
\$Windows.~ls
\Hiberfil.SYS				//休眠文件
\PageFile.SYS				//虚拟内存
\Recycled				//回收站目录
\Recycler				//回收站目录
*\Temp					//临时文件目录
*\Tmp					//临时文件目录
\Windows\CSC				//脱机文件缓存目录
\System Volume Information		//系统卷标信息目录


//在备份系统时(根是C:)，以下5行作为范例已被注释掉
;\Windows\Temp\*			//这样可表示某目录下的所有文件
;\Windows\System32\Config\*.LOG*	//注册表目录的残余垃圾
;\Windows\System32\Config\*.BLF		//注册表目录的残余垃圾(用这方法可表示某目录下的某类文件)
;\Windows\System32\Config\*.*		//注册表目录的残余垃圾(也可这样表示，因为这样写就与无扩展名的不匹配)

[ExclusionException]			//设置例外列表，表中的文件目录将会无条件地被捕获或解压。
					//此规则的设定是为排除一类文件时又要保留其中若干个而设置。

[CompressionExclusionList]		//设置已压缩的文件不再压缩，以加快捕获速度。
					//此节的文件可自行增减
					//排除以下类型的文件在压缩序列，这些文件在WIM映像内不会被压缩。
*.7Z
*.BZ2
*.CAB
*.GZ
*.MP3
*.PNF
*.RAR
*.TAR
*.WIM
*.ZIP

[AlignmentList]				//设置文件在64K边界对齐，在64K边界对齐的任何文件，将不会被压缩，
					//通常情况下此规则没有什么意义，本人也从来没有设置和应用此规则。


[System_Flag]				//映像标志列表，在进行语言本地化时，可自行修改、补充、删除。
可下拉选择也可填写
Education Edition
Embedded Edition
Enterprise Edition
Enterprise LTSB
Enterprise LTSC
Home Basic Edition
Home Edition
IoT Core Edition
IoT Enterprise
IoT Enterprise LTSC
Mobile Edition
Mobile Enterprise
Premium Edition
Professional Edition
Standard Edition
Starter Edition
Ultimate Edition

[Compress_Type]			//压缩类型列表，语言本地化时，此节内容只可翻译，不可修改或删除。
没有压缩(NONE)
默认压缩(XPRESS)
最大压缩(LZX)
极限压缩(LZMS)

[Help_Text1]
                    本页有四部分功能
1、刷新列表
   在表中加入其它工具挂载的映像或移除其它工具卸载的映像，操作无选项。

2、挂载映像
   必选项有映像文件名、目标目录、映像号，可改写挂载是可选项。
3、卸载映像
   必选项是挂载映像的目标目录，[执行卸载处理命令]为可选项。通过单击[卸载映像]按钮或双击列表中的挂载的卷号卸载可写方式挂载映像时，WimTool会提示。双击表头将以不修改方卸载全部映像，双击列表中的文件也以不修改方式卸载映像。WimTool不能挂载或卸载分包文件。
4、解开映像
   必选项与1的相同，无可选项。本工具能解开分割包文件，所有的分包文件必须位于同一目录，且名称要与 ImageX 分割WIM映像生成分包文件的命名规则匹配。

[Help_Text2]
                                       本页有三部分功能

1、定义映像配置文件
   在这个配置文件里，制作映像时，你可以定义那些文件或目录不被捕获到WIM映像内，那些文件在WIM映像内不被再次压缩，那些文件在64K边界对齐；在解开映像时，你也可以定义那些文件被解压出来，那些文件不被解压出来。这个配置文件的定义与ImageX的兼容，你可以使用你的ImageX的配置文件。
2、制作新的映像文件
   必选项有要制作Wim映像的源目录和保存映像的文件名，可选项是压缩类型、映像名称、映像说明和启动标记。
3、向映像中加入新映卷
   必选项与第1部分相同，可选项是映像名称、映像说明和启动标记。当保存的映像文件存在时，WimTool会自动选择与原映像匹配的压缩类型，并自动选上追加方式。不支持向分割包文件中追加新的映像卷。如果你对映像配置文件不是很了解，请不要修改它，用默认的设置即可。
4、强烈建议填写的选项
   不管是新建映像还是追加映卷，强烈建议填写映像名称和映像标志这两个选项，以便调识别映像内容。

[Help_Text3]
                本页有三部分功能

1、导出合并
   将Wim文件存在的映像卷导出成一个新的Wim映像或导入到另一Wim文件中，必选项有源文件名、源文件中的映像号和目标文件名。当从WIM映像中导出一个卷作为全新的WIM映像时，目标映像的压缩类型为可选项。利用导出功能，可将一组分割包合并为一个Wim映像文件；利用导出功能可对WIM映像文件进行优化。
2、分割映像
   必选项有被分割的Wim文件、分割后保存的文件和分包大小，没有可选项。将一个映卷导出为全新映像时，如果改变它的压缩类型可能会使操作变慢；向一个映像导入一个映卷时，压缩类型由目标映像决定；分割 WIM 文件时，分包文件建议不要用数字作基本名。已分割的 WIM 文件不支持再被分割，也不支持向分割包文件导入映像卷。
3、优化转换
   也可实现压缩类型的转换和文件优化，必选项是WIM源文件；如果目标文件名存在时，则将源文件优化或转换到目标文件，否则就源文件进行优化或转换。
4、注意事项
   极限压缩(LZMS)即为ESD压缩，这种压缩类型的文件扩展名可以互换，可通过导出合并功能来实现压缩类型的转换，包括WIM与ESD的互换。利用导出功能进行的压缩类型转换得到的文件更小，但转换操作时间会更长。

[Help_Text4]
          本页有三部分功能

1、删除映像分卷
   从含多个映卷的Wim文件中删除指定映像卷，必选项是Wim映像文件名和映像卷号，没有可选项。不能删除分割包中的映像卷。删除 Wim 文件中的映像卷仅删除元数据及相关条目，并不能减小Wim文件的体积。
2、查看映像信息
   查看Wim映像信息，必选项是文件名，无可选项，可从列表中选择相应的映像卷。
3、修改映像信息
   必选项是文件名，可从列表中选择相应的映像卷，修改其相应的映像信息。

[Help_Text5]
                             外壳执行扩展设置说明

1、目标挂载目录: 是指定双击该WIM映像后挂载的目录，该目录不设置时，会自动挂载下WimTool设置的"自动挂载基础目录"下；用WimMount.SYS驱动时，这些目录必须是 NTFS 分区中的空目录。
2、挂载完成执行: 是指挂载后要执行WIM内的命令，以下称"挂载命令"。
3、卸载之前执行: 是指卸载之前要执行的命令，以下称"卸载命令"。"挂载命令"、"卸载命令"目前只支持Windows系统的.EXE文件(可带参数)，
4、结束自动卸载: 是指"挂载命令"执行完成后自动卸载WIM，并执行"卸载命令"和"删除卸载目录"等操作。
5、外壳执行扩展中支持以下环境变量：
   %MountDir%: 表示Wim映像的挂载目录
   %AppPath%:  表示WimTool所在的目录
   %WimFile%:  表示挂载的Wim映像文件

[Help_Text6]
         本页有四部分功能

1、设置映像扩展图标
   必选项映像文件名、图标资源文件名和图标，图标大小是可选项。用 WimTool注册[图标扩展功能]才能看到显示效果。性能差的机子不要写入64*64以上大图标。
2、删除映像扩展图标
   必选项映像文件名，无可选项。
3、重建系统图标缓存
   当WIM扩展图标显示失效或系统图标显示出错时，重建图标缓存可使图标显示正常，重建图标缓存时可能会使资源管器视图中的图标作重新排列。
4、提取文件中的图标
   必选项是EXE、DLL、CPL等含有图标的资源文件，选择资源中的某个图标，将其保存为图标ICO文件。

[Help_Text7]
                           本页有六部分功能

1、设置文件关联
   用于设置双击WIM文件时可通过WimTool挂载WIM映像，并执行WIM映像内设置好的挂载处理命令。如果该WIM映像没有设置挂载处理命令，则打开挂载目录。
2、取消文件关联
   用于取消WIM映像文件与WimTool的文件关联设置。当系统中的WIM文件关联出现错误或异常时，可以先点[取消文件关联]，再点[设置文件关联]来修复。
3、注册扩展功能
   扩展功能有三部分：一是右键扩展菜单，通过右键菜单可以对WIM文件、文件夹用WimTool进行快速处理，如挂载WIM文件、将文件夹压制成WIM映像以及对挂载目录、WIM映像进行卸载等；二是外壳图标扩展，每个WIM文件都可以设置自己的特色图标，如同不同的 EXE文件有不同的图标一样；三是外壳执行扩展，即文件关联功能。这三部分功能可单独注册，互不影响。
4、卸载扩展功能
   包括卸载[右键扩展菜单]、[外壳图标扩展]和[外壳执行扩展]，这三部分功能可单独卸载，互不影响。
5、设置默认参数
   恢复WimTool初始时各参数、自动挂载基础路径和WIM临时工作目录的默认设置。
6、保存应用设置
   保存WimTool各参数、自动挂载基础路径和WIM临时工作目录的设置，这些设置会关联第一页的参数设置。
   一个WIM映像没有设置好挂载目录时会自动挂载到"自动挂载基础路径"的子目录下；WIM临时工作目录建议设置到硬盘自由空间充足的位置，这一目录的设置不会影响系统的临时目录。

[Help_Text8]
             扩展功能说明 
1、扩展功能并非 WIMGAPI.DLL 的功能，三项功能可单独注册，互不影响；
2、注册外壳图标扩展后可能一些机子的资源管理器不稳定，可以卸载它。

[String_List]			//字符资源列表，语言本地化时，此节内容只可翻译，不可修改或删除。
0=挂载和解开
1=新制和追加
2=导出和分割
3=删卷和信息
4=浏览和提取
5=外壳执行页
6=外壳图标页
7=注册及设置
8=说明和声明
9=WimTool - 编辑配置文件
10=执行展开映像任务...
11=打开映像文件...
12=注册回调消息...
13=设置临时目录...
14=加载映像分卷...
15=开始展开映像...
16=关闭映像分卷...
17=卸载回调消息...
18=关闭映像文件...
19=展开映像文件...
20=用户终止了操作！
21=完成
22=失败
23=是
24=否
25=挂载映像文件...
26=找不到列表中挂载的映像路径，
27=可能该挂载路径已被其它工具卸载。
28=选择卸载WIM映像的方式
29=你所卸载的WIM映像是以可写方式挂载的，
30=卸载时是否将修改结果更新到原WIM文件中？
31=要更新选择[是]，不更新选择[否]，放弃操作选择[取消]。
32=卸载映像文件...
33=锁定
34=映像文件
35=挂载路径
36=卷号
37=可写
38=选择挂载或解开的目标文件夹
39=解开WIM映像的目录已存在文件，
40=从WIM映像中解开的文件会改写原有的文件，
41=是否继续将WIM映像解开并覆盖原有的文件？
42=继续解开选择[是]，不解开选择[否]。
43=选择是否继续解开WIM映像
44=目标文件夹中已存在文件！
45=WIM映像不能挂载到已存在文件的目录中。
46=提示
47=刷新挂载列表...
48=已挂载的映卷数为:%u
49=卸载映像文件:%s ...
50=没有可卸载的映像，映像已锁定。
51=已用时间：
52=剩余时间：
53=文件数目：
54=解开映像
55=配置文件
56=卸载映像
57=挂载映像
58=刷新列表
59=选择挂载或解开的WIM文件
60=选择挂载或解开的目标文件夹
61=已挂载的映像信息
62=浏览
63=选项[2]
64=选项[1]
65=提示信息
66=卸载后删挂载目录
67=双击路径打开目录
68=双击文件卸载映像
69=双击表头卸载全部
70=清除文件安全权限
71=任务前清空信息
72=可读写方式挂载
73=完成后打开目录
74=不使用配置文件
75=映像卷号：
76=终止执行
77=可能无法挂载或卸载
78=目标映像是分割包文件，无法向分割包追加映像！
79=执行追加映像任务...
80=执行新建映像任务..
81=追加映像分卷...
82=建立映像文件...
83=添加启动标志...
84=追加映像文件...
85=新建映像文件...
86=保存WIM文件
87=执行挂载卸载处理
88=选择要制作成WIM映像的源目录
89=选择保存WIM映像的文件名
90=映像名称：
91=映像说明：
92=显示名称：
93=显示说明：
94=追加映像
95=新建映像
96=压缩类型：
97=映像标志：
98=给该卷加上启动标志
99=任务前清空提示信息
100=不使用捕获配置文件
101=执行分割任务...
102=打开源头文件...
103=分包文件如下：
104=分割映像文件...
105=执行导出任务...
106=打开目标文件...
107=导出映像分卷...
108=导出映像文件...
109=关闭目标文件...
110=关闭源头文件...
111=打开分包文件错误！
112=映像导出任务...
113=已是分割包文件，不能再被分割！
114=导出合并
115=选择要导出的WIM映像源文件或映像分包文件
116=选择导出后的WIM目标文件名或合并后的文件
117=分割映像
118=选择要分割的WIM映像文件名
119=选择分割后的WIM目标文件名
120=目标WIM文件
121=分包大小设置错误！
122=选择是否终止当前的操作？
123=WimTool正在执行导出映像操作，若终止当前的操作，
124=获得的文件将是不完整的或损坏的，
125=建议你不要终止当前的操作！
126=要终止当前操作请选择[是]，要继续当前操作请选择[否]。
127=未知
128=目录数目
129=映像卷名：
130=任务选择及目标设置
131=分包大小(M)：
132=请选择一个扩展名为“.wim”的文件
133=Windows 映像格式
134=预测中...
135=默认
136=关闭
137=应用
138=保存
139=载入
140=提示
141=如果你不了解这配置文件，请不要修改它，使用默认设置，
142=如果你已修改了它又想使用默认的设置，请点[默认]按钮。
143=[当前]
144=保存配置文件
145=目标文件已存在，
146=是否覆盖已有的文件？
147=覆盖原有的文件选择[是]，否则选择[否]。
148=选择是否覆盖已有的文件
149=图标资源文件
150=打开文件
151=映像名称
152=系统体系
153=系统版本
154=默认语言
155=展开大小
156=映像信息
157=修改映像信息
158=删除映像分卷
159=WIM 映像文件
160=读取映像信息...
161=属于分割包文件[%u/%u]，不能修改信息！
162=请在列表中选择卷号。
163=删除映像分卷...
164=映像信息已经更新。
165=修改映像信息...
166=基本信息
167=文件路径：
168=映卷总数：
169=分包文件：
170=启动映卷：
171=[没有设置]
172=映像大小：
173=目录数目：
174=修改时间：
175=WimTool正在执行展开映像操作，若终止当前操作，
176=建议你不要终止当前的操作！
177=WimTool正在执行捕获映像操作，若终止当前操作，
178=选择目标挂载目录
179=设置WimTool外壳扩展功能...
180=清除WimTool外壳扩展功能...
181=WimTool外壳扩展功能设置
182=可写方式挂载
183=结束自动卸载
184=卸载保存更改
185=卸载删除目录
186=目标挂载目录：
187=挂载完成执行：
188=卸载之前执行：
189=选项
190=卷名：
191=说明：
192=清除设置
193=应用设置
194=分割包文件，不能写入图标数据！
195=执行写入扩展图标任务
196=执行删除扩展图标任务
197=设置扩展图标...
198=删除图标数据...
199=失败，无法写入图标数据。
200=失败，读取不到图标数据。
201=所请求的任务成功完成。
202=所请求的任务无法完成。
203=图标资源
204=重建图标缓存完成，建议重启或注销。
205=保存图标文件
206=图标文件(*.ICO)
207=选择是否覆盖原有的图标文件
208=目标图标文件已存在，
209=是否覆盖原有的图标文件？
210=用户取消了操作。
211=图标列表
212=图标大小
213=重建图标缓存
214=删除扩展图标
215=写入扩展图标
216=图标资源文件
217=WIM映像及图标资源
218=图标大小及显示效果
219=WIM中扩展图标
220=无图标
221=是否继续执行你选择的操作？
222=该目录下的所有文件目录将被删除！
223=继续执行选择[是]，取消执行选择[否]。
224=清理 WIM 自动挂载基础目录...
225=清理 WIM 临时工作目录...
226=WimTool - 注册扩展功能
227=WimTool - 卸载扩展功能
228=载入默认的参数设置...
229=应用并保存当前的设置...
230=选择WIM自动挂载基础目录
231=选择WIM临时工作目录
232=除WIM映像已挂载的目录外，
233=设置文件关联
234=取消文件关联
235=WimTool 目录设置
236=清理
237=自动挂载基础目录：
238=WIM 临时工作目录：
239=保存应用设置
240=设置默认参数
241=卸载扩展功能
242=注册扩展功能
243=参数设置
244=清空原有提示信息
245=操作完成打开目录
246=正在解开映像...
247=正在捕获映像...
248=取消
249=要更新选择[是]，不更新选择[否]。
250=注册选项
251=卸载选项
252=资源管理器外壳图标扩展
253=资源管理器外壳菜单扩展
254=资源管理器文件关联设置
255=建立基础挂载目录失败，
256=请将基础挂载目录设置到可写分区。
257=建立临时工作目录失败，
258=请将临时工作目录设置到可写分区。
259=注册外壳图标扩展扩展...
260=卸载外壳图标扩展扩展...
261=注册外壳菜单扩展扩展...
262=卸载外壳菜单扩展扩展...
263=加载扩展功能的 DLL 发生错误！
264=注册外壳执行扩展扩展...
265=卸载外壳执行扩展扩展...
266=建议重启或注销。
267=WimTool - WIM映像处理工具
268=复制 (Ctrl + C)
269=全选 (Ctrl + A)
270=老九作品，精品工具；版本所有，免费使用
271=选择解开的目标文件夹
272=用 WimTool 处理(&S)...
273=添加到 WIM 映像(&A)...
274=用 WimTool 只读卸载(&R)
275=用 WimTool 可写卸载(&W)
276=添加到 WIM 映像(&A)...
277=添加到
278=解压到
279=解压到指定目录(&A)...
280=用 WimTool 只读挂载(&R)
281=用 WimTool 可写挂载(&W)
282=用 WimTool 卸载所有(&T)
283=线程异常结束，残留的目标文件是损坏的，关闭 WimTool 后方可删除。
284=安全终止
285=强行终止
286=返回继续
287=建议选择[安全终止]，等待线程正常结束。
288=[强行终止]会立即结束，但可能造成程序崩溃。
289=要想继续操行当前的操作，选择[返回继续]。
290=WimTool正在执行分割映像操作，若终止当前的操作，
291=WimTool - 查看映像详细信息
292=映像详细信息
293=给个名称吧
294=正在导出映像...
295=代码内置DLL，
296=查看映像信息
297=系统体系：
298=系统版本：
299=展开大小：
300=默认语言：
301=WimTool.EXE同目录下的WimShExt.DLL不存在，或64位、32位不匹配。
302=图像尺寸过大，不适合转换成图标！
303=检测不到
304=WimTool与系统64位或32位不匹配！
305=目标WIM文件已存在，新制作的文件将会覆盖原有的文件，
306=要确定新制作的文件选择[是]，放弃操作选择[否]。
307=窗口置顶
308=提取...
309=追加...
310=删除...
311=打开...
312=属性...
313=序号
314=文件目录
315=类型名称
316=文件大小
317=创建时间
318=修改时间
319=显示映像扩展图标
320=双击时打开该文件
321=卷映像
322=请选择将文件提取到的目标目录。
323=提取文件
324=请选择一个要加入的目录。
325=追加新卷
326=请选择一个要追加的文件目录。
327=追加文件目录
328=删除卷映像
329=确定要删除WIM内的这个卷映像吗？
330=确定删除选择[是]，放弃删除选择[否]。
331=删除文件目录
332=确定要删除WIM内的这些文件目录吗？
333=正在追加建立新卷，
334=此过程不显示进度，请稍候...
335=正在加入文件目录
336=正在删除文件目录
337=正在删除卷映像
338=WimTool正在执行提取文件操作，若终止当前操作，
339=创建时间：
340=优化映像重新压缩
341=提取完成打开目录
342=此处只能追加一个文件目录，不能追加整个分区。
343=此处只能拖入目录，不接受拖入文件。
344=WimTool 不是以管理员身份执行，功能会受到限制。
345=新建文件夹
346=上级目录
347=文件夹
348=文件
349=改名...
350=优化...
351=优化映像
352=目标文件中已存在相同的映像卷。
353=执行转换任务...
354=执行优化任务...
355=错误代码：
356=分割包文件，不支持原文件直接优化转换！
357=映像说明
358=选择一个要被优化或转换的源WIM映像文件名
359=选择一个被优化或转换后的目标WIM映像文件
360=WimTool正在执行优化转换映像操作，若终止当前的操作，
361=优化转换
362=映卷已存在也被导入
363=服务异常，
364=无法挂载或卸载
365=SYS与DLL版本不匹配，
366=列出被排除项目
367=WIMLIB兼热备份支持
368=已排除:
369=开启热备份环境...
370=源目标不支持在线热备份。
371=搜索
372=新建目标文件...
373=优化转换映像...
374=正在优化映像...
375=设置映像信息...
376=所请求的操作...
377=文件数目
